const CompanyBitrix = require('../models/bitrix')
const Company = require('../models/company')
const createCompanyField = require('./create-company-field')
const stringToArray  = require("./string-to-array")
const saveAll = require("./mongoose-save-all")


const fioID = [
  {
    id: '1164',
    fio: ['рутковский', 'александр', 'германович']
  },
  {
    id: '1152',
    fio: ['ахмедов', 'геннадий', 'михайлович'],
  },
  {
    id: '8574',
    fio: ['', 'денис', 'алексеевич'],
  },
  {
    id: '8652',
    fio: ['ионов', 'алексей', 'александрович'],
  },
  {
    id: '39728',
    fio: ['тюльга', 'татьяна', 'владимировна'],
  },
  {
    id: '49848',
    fio: ['анастасия', 'александровна', ''],
  },
  {
    id: '92602',
    fio: ['карасюк', 'григорий', 'владимирович'],
  },
  {
    id: '118600',
    fio: ['молодцов', 'виктор', 'геннадьевич'],
  },
  {
    id: '118598',
    fio: ['кондрашов', 'игорь', 'иванович'],
  },
  {
    id: '118596',
    fio: ['давыдкина', 'наталья', 'леонидовна'],
  },
  {
    id: '121300',
    fio: ['Меркурьева', 'Оксана', 'Александровна'],
  },
  {
    id: '121298',
    fio: ['Гусаров', 'Дмитрий', 'Петрович'],
  },
  {
    id: '121296',
    fio: ['Райтман', 'Светлана', 'Ивановна'],
  },
  {
    id: '123132',
    fio: ['Дворкина', 'Евгения', 'Владимировна'],
  },
  {
    id: '124188',
    fio: ['Лубневский', 'Константин', 'Казимирович'],
  },
  {
    id: '127584',
    fio: ['Федотов', 'Игорь', 'Игоревич'],
  },
  {
    id: '127818',
    fio: ['Алексеева', 'Ольга', 'Валерьевна'],
  },
  {
    id: '131818',
    fio: ['Соловьева', 'Екатерина', 'Семеновна'],
  },
  {
    id: '131816',
    fio: ['Алямов', 'Андрей', 'Вячеславович'],
  },
  {
    id: '134638',
    fio: ['Каптилович', 'Владислав', 'Валериевич'],
  },
  {
    id: '137444',
    fio: ['Меликидзе', 'Александр', 'Автандилович'],
  },
  {
    id: '142074',
    fio: ['Белоусов', 'Эдуард', 'Александрович'],
  },
  {
    id: '142072',
    fio: ['Беспалов', 'Олег', 'Евгеньевич'],
  },
  {
    id: '143282',
    fio: ['Белов', 'Дмитрий', 'Борисович'],
  },
  {
    id: '149052',
    fio: ['Алимов', 'Сергей', 'Анатольевич'],
  },
  {
    id: '149048',
    fio: ['Мельников', 'Сергей', 'Алексеевич'],
  },
  {
    id: '157700',
    fio: ['Алексеев', 'Александр', 'Петрович'],
  },
  {
    id: '157694',
    fio: ['Карташян', 'Армен', 'Самвелович'],
  },
  {
    id: '157712',
    fio: ['Булавка', 'Борис', 'Егорович'],
  },
  {
    id: '157706',
    fio: ['Мусиенко', 'Татьяна', 'Константиновна'],
  },
  {
    id: '157704',
    fio: ['Зайцева', 'Елена', 'Ивановна'],
  },
  {
    id: '162602',
    fio: ['Кужекина', 'Анна', 'Владимировна'],
  },
  {
    id: '162604',
    fio: ['Антонова', 'Ирина', 'Георгиевна'],
  },
  {
    id: '173816',
    fio: ['Першин', 'Олег', 'Алексеевич'],
  },
  {
    id: '182392',
    fio: ['Алиева', 'Анастасия', 'Мустафаевна'],
  },
  {
    id: '188130',
    fio: ['Ефремов', 'Александр', 'Иннокентьевич'],
  },
  {
    id: '196462',
    fio: ['Бельчихина', 'Жанна', 'Александровна'],
  },
  {
    id: '196458',
    fio: ['Шаклеин', 'Александр', 'Геннадьевич'],
  },
  {
    id: '202604',
    fio: ['Бородин', 'Олег', 'Олегович'],
  },
  {
    id: '203526',
    fio: ['Якимец', 'Елена', 'Гранитовна'],
  },
  {
    id: '313434',
    fio: ['Дмитриев', 'Виктор', 'Александрович'],
  },
  {
    id: '343084',
    fio: ['Долинская', 'Светлана', 'Николаевна'],
  },
  {
    id: '398122',
    fio: ['Доровских', 'Иван', 'Владимирович'],
  },
  {
    id: '433316',
    fio: ['Белов', 'Роман', 'Петрович'],
  },
  {
    id: '545006',
    fio: ['Касаткин', 'Роман', 'Сергеевич'],
  },
  {
    id: '552106',
    fio: ['', 'Нина', 'Михайловна'],
  },
  {
    id: '560402',
    fio: ['Васильева', 'Татьяна', 'Анатольевна'],
  },
  {
    id: '589508',
    fio: ['Выволокин', 'Андрей', 'Николаевич'],
  },
  {
    id: '595966',
    fio: ['Данилина', 'Жанна', 'Сергеевна'],
  },
  {
    id: '650824',
    fio: ['Караваев', 'Борис', 'Владимирович'],
  },
  {
    id: '686606',
    fio: ['Плеханов', 'Александр', 'Александрович'],
  },
  {
    id: '703272',
    fio: ['Луина', 'Алла', 'Витальевна'],
  },
  {
    id: '714156',
    fio: ['Карташов', 'Сергей', 'Вячеславович'],
  },
  {
    id: '719564',
    fio: ['Коняхин', 'Виталий', 'Федорович'],
  },
  {
    id: '735464',
    fio: ['Типенко', 'Наталия', 'Георгиевна'],
  },
  {
    id: '754204',
    fio: ['Расковалов', 'Никита', 'Вадимович'],
  },
  {
    id: '792248',
    fio: ['Купасов', 'Владимир', 'Юрьевич'],
  },
  {
    id: '811496',
    fio: ['Ремизова', 'Ирина', 'Борисовна'],
  },
  {
    id: '816680',
    fio: ['Манов', 'Андрей', 'Иванович'],
  },
]


const documents = []

CompanyBitrix.find()
  .then((data) => {
    const mongoose = require('./mongoose')
    data.forEach((itemBitrix) => {
      fioID.forEach((itemFioID) => {
        if (itemFioID.id === itemBitrix.id) {
          const fio = itemFioID.fio.map((word) => word.toLowerCase())

          const company = new Company({
            _id: new mongoose.Types.ObjectId(),
            companyName: createCompanyField({ companyName: itemBitrix.companyName }),
            fio,
            email: itemBitrix.email,
            inn: stringToArray(itemBitrix.inn),
            adress: stringToArray(itemBitrix.adress),
            phone: stringToArray(itemBitrix.phone)
          });

          documents.push(company)
        }
      })
    })

    return saveAll({ documents })
  })
  .then(() => {
    console.log('Данные сохранены');
  })
  .catch((e) => {
    console.log(e)
  })